{
  "products": [
    {
      "id": 1,
      "title": "Smartphone Galaxy S23",
      "short_description": "Smartphone Samsung Galaxy S23 com câmera de 50MP",
      "full_description": "O Samsung Galaxy S23 é um smartphone premium com tela AMOLED de 6.1 polegadas, processador Snapdragon 8 Gen 2, 8GB de RAM e 128GB de armazenamento. Possui câmera traseira tripla com sensor principal de 50MP, câmera frontal de 12MP e bateria de 3900mAh com carregamento rápido de 25W.",
      "price": 3999.99,
      "images": [
        "img/celular.webp",
        "img/s23.jpeg",
        "img/celular.webp"
      ],
      "category": "Smartphones"
    },
    {
      "id": 2,
      "title": "Notebook Dell Inspiron",
      "short_description": "Notebook Dell Inspiron com processador Intel i5",
      "full_description": "Notebook Dell Inspiron 15 com tela de 15.6 polegadas Full HD, processador Intel Core i5-1135G7, 8GB de RAM DDR4, SSD de 256GB e placa de vídeo integrada Intel Iris Xe. Ideal para trabalho e estudos, com design elegante e bateria de longa duração.",
      "price": 2899.99,
      "images": [
        "img/notebook.avif",
        "img/dellnotebook.webp",
        "img/notebook.avif"
      ],
      "category": "Notebooks"
    },
    {
      "id": 3,
      "title": "Fone de Ouvido Sony WH-1000XM4",
      "short_description": "Fone de ouvido sem fio com cancelamento de ruído",
      "full_description": "Fone de ouvido Sony WH-1000XM4 com cancelamento de ruído ativo de última geração, bateria de até 30 horas de reprodução, conectividade Bluetooth 5.0 e NFC. Possui controles de toque, assistente de voz integrado e design confortável para uso prolongado.",
      "price": 1299.99,
      "images": [
        "img/fone.jpg",
        "img/fone2.jpg",
        "img/fone.jpg"
      ],
      "category": "Áudio"
    },
    {
      "id": 4,
      "title": "Smart TV LG 55\" 4K",
      "short_description": "Smart TV LG 55 polegadas com resolução 4K",
      "full_description": "Smart TV LG 55 polegadas com resolução 4K Ultra HD, processador α7 Gen 5, webOS 6.0, HDR10 e Dolby Vision. Possui 4 portas HDMI, 2 portas USB, Wi-Fi e Bluetooth integrados. Compatível com Netflix, Prime Video e outros serviços de streaming.",
      "price": 2499.99,
      "images": [
        "img/tv.jpeg"
      ],
      "category": "TVs"
    },
    {
      "id": 5,
      "title": "Câmera Canon EOS R6",
      "short_description": "Câmera mirrorless Canon EOS R6 com sensor full-frame",
      "full_description": "Câmera mirrorless Canon EOS R6 com sensor CMOS full-frame de 20.1MP, estabilização de imagem de 5 eixos, gravação 4K até 60fps e sistema de foco automático Dual Pixel CMOS AF II. Ideal para fotografia profissional e videografia.",
      "price": 8999.99,
      "images": [
        "img/camera.webp"
      ],
      "category": "Câmeras"
    },
    {
      "id": 6,
      "title": "Console PlayStation 5",
      "short_description": "Console PlayStation 5 com controle DualSense",
      "full_description": "Console PlayStation 5 com processador AMD Zen 2, GPU AMD RDNA 2, SSD ultra-rápido de 825GB e suporte a ray tracing. Inclui controle DualSense com feedback háptico e gatilhos adaptativos. Compatível com jogos PS4 e PS5.",
      "price": 3499.99,
      "images": [
        "img/videogame.jpeg"
      ],
      "category": "Games"
    }
  ]
}
